#2
# a = int(input("Введите стоимость комплекта ракеток: "))
# b = int(input("Введите стоимость шарика: "))
# c = int(input("Введите баланс Феофилакта: "))
#
# if a >=0 and b >=0 and c >=0 and c>=a:
#     print((c-a)//b)
# else:
#     print("Введены некорректные данные!")
#---------------------------------------------------------
#3
# a = int(input("Введите неоднозначное число: "))
#
# if a > 9:
#     print((a // 10) % 10)
# else:
#     print("Введено однозначное число!")
#----------------------------------------------------------
#4
# a = input("Введите четырёхзначное число: ")
# b = [int(c) for c in a]
# print(sum(b))
#-----------------------------------------------------------
#5
# n = int(input("Введите число прошедших минут: "))
# print("Кол-во прошедших часов:", n // 60)
# print("Минут:", n % 60)